// OOP_L_2.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include <iostream>
#include "Sourse.cpp"

using namespace std;
/*
Варіант 7
Імітація черги на отримання житла. Клас "учасник черги" -- прізвище,
телефон, дата постановки в чергу. Неупорядкований масив "учасників черги"
перетворити в стандартиний контейнер priority queue. Побудувати функції:
- визначення довдини черги;
- додавання нового елемента в чергу ( постановлення на облік нового
учасника);
- вилучення учасників, що отримали житло ( по черзі).
Пероедбачити виключні ситуації: дата постановки на облік більга за
поточну; дата постановлення на облік не дорівнює поточній для нових учасників.
*/

int main()
{
	PartyQueue * a;
	Date * b;
	a = new PartyQueue[30];
	b = new Date[30];
	for (int i = 0; i < 30; i++)
	{
		a[i] = PartyQueue(string("Windows"), string("+1 202 - 456 - 1111"), Date( i+1, i/ 5 + 6 , 2000+i));
		b[i] = Date(i + 1, i / 5 + 6, 2000 + i);
	}
	QueueHousing c(a, b, 30);
	cout << c.longQueue() << endl;
//	c.push(c.top());
	while (c.longQueue())
	{
		cout << c.top() << ";;;";
		cout << c.longQueue() << endl;
		c.pop();
	}
	system("pause");

    return 0;
}
