// OOP_L_2.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include <iostream>
#include "Sourse.h"
using namespace std;
/*
Варіант 7
Імітація черги на отримання житла. Клас "учасник черги" -- прізвище,
телефон, дата постановки в чергу. Неупорядкований масив "учасників черги"
перетворити в стандартиний контейнер priority queue. Побудувати функції:
- визначення довдини черги;
- додавання нового елемента в чергу ( постановлення на облік нового
учасника);
- вилучення учасників, що отримали житло ( по черзі).
Пероедбачити виключні ситуації: дата постановки на облік більга за 
поточну; дата постановлення на облік не дорівнює поточній для нових учасників.
*/

int main()
{
    return 0;
}

